export type QuizQuestion = {
  question: string
  description: string
}

export const quizQuestions: QuizQuestion[] = [
  {
    question:
      'Бывало ли так, что вы решали не пить неделю или более, но вас хватало только на пару дней?',
    description:
      'Большинство из нас, членов АА, давали самые разные обещания самим себе и своим семьям. Но мы не могли их сдержать. Затем мы пришли в АА. Там нам сказали: «Попытайтесь не пить только сегодня». (Если вы сегодня не выпьете, то вы сегодня и не напьётесь.)',
  },
  {
    question:
      'Хотелось ли вам, чтобы окружающие перестали говорить вам о вашем пьянстве и о том, что вам следует делать?',
    description:
      'В АА мы никому не указываем, что им надо делать. Мы просто рассказываем, как мы пили сами, к каким это привело неприятностям и как нам удалось это прекратить. Мы будем рады вам помочь, если этого захотите вы.',
  },
  {
    question:
      'Пытались ли вы переключаться с одного вида выпивки на другой в надежде, что это поможет вам не напиться?',
    description:
      'Мы перепробовали всё. Мы разбавляли выпивку, пили только пиво, старались не смешивать, пытались пить только в выходные дни. Что бы вы ни сказали - мы это тоже пробовали. И когда мы выпивали что бы то ни было, содержащее алкоголь, - мы, как правило, напивались.',
  },
  {
    question:
      'Приходилось ли вам в течение последнего года выпивать утром, чтобы обрести способность начать новый день?',
    description:
      'Вам нужно опохмелиться, чтобы двигаться дальше, или чтобы прекратило трясти? Это один из верных признаков того, что вы пьёте не "как все".',
  },
  {
    question:
      'Случалось ли вам завидовать людям, которые могут пить без неприятных последствии?',
    description:
      'Время от времени многие из нас задумывались, почему мы отличаемся от большинства других людей, которые могут контролировать свою выпивку.',
  },
  {
    question: 'Случались ли у вас в течение последнего года проблемы из-за выпивки?',
    description:
      'Будем честными! Врачи утверждают, что если возникает проблема, связанная с алкоголем, и вы продолжаете пить, то эта проблема может только ухудшаться.',
  },
  {
    question: 'Возникали ли у вас из-за выпивки неприятности в семье?',
    description:
      'До тех пор, пока мы не пришли в АА, многие из нас говорили, что к выпивке нас подталкивают домашние проблемы.',
  },
  {
    question:
      'Случалось ли так, что, выпивая в компании, вы старались перехватить дополнительный стаканчик, потому что вам не хватало?',
    description:
      'Большинство из нас предварительно «чуть-чуть принимали», если ожидалось, что это будет «не та» компания.',
  },
  {
    question:
      'Утверждаете ли вы, что можете перестать пить в любой момент, как только захотите?',
    description: 'Многие из нас обманывали себя, считая, будто мы пьём по желанию.',
  },
  {
    question: 'Приходилось ли вам прогуливать работу или занятия в связи с выпивками?',
    description:
      'Многие из нас теперь признаются, что частенько сказывались по телефону «больными».',
  },
  {
    question: 'Случались ли у вас провалы памяти?',
    description:
      'Имеются в виду случаи, когда мы пили в течение многих часов или нескольких дней, а потом ничего не могли вспомнить.',
  },
  {
    question:
      'Появлялось ли у вас когда-либо ощущение, что если бы вы не пили, то ваша жизнь была бы лучше?',
    description: 'Многие из нас начинали пить, потому что после выпивки жизнь казалась лучше.',
  },
]
